# Built In Failures Rebar Failures Rebar Crank Over Hook Property

Source: https://www.revitapidocs.com/2026/4591bafc-6436-5e1b-58c0-142ced98c18d.htm

---

| Built In Failures Rebar Failures Rebar Crank Over Hook Property |
| --- |

Cannot add crank to the end that already has a hook.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static FailureDefinitionId RebarCrankOverHook { get; }
```

```
Public Shared ReadOnly Property RebarCrankOverHook As FailureDefinitionId
	Get
```

```
public:
static property FailureDefinitionId^ RebarCrankOverHook {
	FailureDefinitionId^ get ();
}
```

```
static member RebarCrankOverHook : FailureDefinitionId with get
```

#### Property Value

FailureDefinitionId See Also

#### Reference

BuiltInFailures RebarFailures Class Autodesk.Revit.DB Namespace